
  自从入党以来，我觉得我各方面都得到了一定的提高，因为加入了中国共产党，就要用党规党章要求自己，
各方面都不能懈怠，要给同学们有一个榜样的作用。我一直都没用动摇过自己入党的决心，中国共产党的信
念已经深深在我心里扎根，只有在党的领导下中国才能走向繁荣富强，。我来自广西的一个小农村，体会
得到党在土地、种植等各方面给广大农民带来的政策上的扶持，是一个真正代表广大人们利益的党。
从我自身的角度来说，我要争取做一个合格的党员，履行党员的义务，发挥先锋模范作用。正如入党誓词里
面所讲，加入中国共产党是一种自愿向党组织靠拢的行为，要履行作为党员的基本义务，对得起组织的培养。
在大的层面上说，我国有八千多万党员，除了个人的自觉性，国家也要用党规党章，法律法规来全面从严治党。
只要党自身建设好了，才能得到广大人们群众的爱戴和支持。更重要的是，实际上任然有部分党员甚至干部领导
没有履行党员义务，没有本着为人们谋福祉的原则为群众办事，因此加强党员的组织、思想、作风建设十分重要。
“党政军民学，东西南北中，党是领导一切的”，说明党是一切其他组织的领导核心，无论是军队，政府，工农
商学都有服从党的领导，而中国特色社会主义建设更要坚持党的领导，这样我们中华民族才能凝聚在一起办大事，
实现中华名族的伟大复习。在十九大里，习总书记提出，我国进入了中国特色社会主义新时代，中华民族站起来了，
走向了繁荣富强的道路，人民的主要矛盾从当初的人民对日益发展的物质文化需求同落后的社会生产之间的茅盾变
成了人民的美好物质文化需求和不平衡不充分的发展之间 的矛盾，说明大部分群众生活富裕了，开始想着决胜
全面小康社会迈进。 
   能加入中国共产党是光荣的。我会在今后的学习折生活中，更加严格要求自己，努力提高自身能力，发挥党员
的先锋模范作用。
